[
  {
    "id": "3zv4rv9h7vt",
    "title": "Born at Kuliana",
    "color": "gray",
    "icon": "cake",
    "date": "2001-09-19",
    "cardTitle": "This is where it all began",
    "cardDescription": "I was born at Kulipal, a small village in the outskirts of Kuliana, northern path of Odisha."
  },
  {
    "id": "laxmc1igr4p",
    "title": "Secured global rank of 404",
    "color": "teal",
    "icon": "star",
    "date": "2021-03-28",
    "cardTitle": "Secured global rank of 404",
    "cardDescription": "I had account in codechef and practiced a couple questions here and there but never appear for competition. I did and secured global rank of 404."
  },
  {
    "id": "rh9uaxzydzk",
    "title": "Started B. Tech. CSIT",
    "color": "green",
    "icon": "academic",
    "date": "2020-10-08",
    "cardTitle": "Took admission in ITER",
    "cardDescription": "Not everyone is lucky enough to get into elite IIT. So I got into one of the recognised university of Odisha, SOA University."
  },
  {
    "id": "j1sh6lr7igg",
    "title": "Completed Class 12",
    "color": "green",
    "icon": "academic",
    "date": "2020-07-30",
    "cardTitle": "Secured 94% in AISSCE",
    "cardDescription": "I was the head boy of DAV from 2018 to 2020. I was honoured with the award of disciplined boy and student of the year. I secured 94% in CBSE Board Exam and was class Topper too."
  },
  {
    "id": "j1sh6lr7igg",
    "title": "Completed Class 10",
    "color": "green",
    "icon": "academic",
    "date": "2018-04-13",
    "cardTitle": "Secured 96% in AISSE",
    "cardDescription": "I was the class Topper of SVS with 96% of marks in CBSE class 10 Board examination. I was the computer geek of my school. I spent nearly 6 years of my life and made couple of friends there."
  },
  {
    "id": "eixykrd3w0l",
    "title": "Built my first app",
    "color": "indigo",
    "icon": "mobile",
    "date": "2018-01-25",
    "cardTitle": "Built TicTacToe in class 10",
    "cardDescription": "Built my first app Captain aka TicTacToe. However, with no mini max algorithm unfortunately. But it has multiplayer support."
  },
  {
    "id": "ws9c1a7zln",
    "title": "Won first Hackathon",
    "color": "orange",
    "icon": "desktop",
    "date": "2020-07-28",
    "cardTitle": "Won HackBenchers #4 in Hackerearth",
    "cardDescription": "I worked on the project more than two weeks start from design to development. It was a great experience after all."
  },
  {
    "id": "n3eulwxuep",
    "title": "Got my first client",
    "color": "orange",
    "icon": "desktop",
    "date": "2020-08-28",
    "cardTitle": "Built website and apps for a coaching institute",
    "cardDescription": "Rank 1 in google search. Developed Android app and CMS for internal use also focused in user experience and interface with proper competitive analysis."
  },
  {
    "id": "6fd3n0f3ue",
    "title": "Deployed Klip it",
    "color": "purple",
    "icon": "desktop",
    "date": "2021-11-17",
    "cardTitle": "Released a simple website for bidirectional pasting",
    "cardDescription": "There are times when I need to visit some site on a desktop which I dont't own. I am too lazy to type link. So I built this little website for bidirectional copy and pasting from PC to Mobile and vice versa. It was built with vite and firebase."
  },
  {
    "id": "pcqhp6apjg",
    "title": "Appointed as coordinator of Codex",
    "color": "orange",
    "icon": "star",
    "date": "2022-05-07",
    "cardTitle": "Coordinator in Codex coding club",
    "cardDescription": "Codex is one of the coding club in ITER. I am currently coodinator of it. Looking forward to it. Built codex website with other fellow coordinators."
  },
  {
    "id": "z8cv3s4k9x8",
    "title": "Software Developer Intern Vaizle",
    "color": "indigo",
    "icon": "star",
    "date": "2022-07-01",
    "cardTitle": "Vaizle is an ad analysis, social media benchmarking and reporting tool for startups",
    "cardDescription": "Developed Angular-based analytics tools for analyzing LinkedIn and YouTube accounts. Implemented a REST API for internal tools in NestJS that runs as a serverless function in GCP."
  },
  {
    "id": "m2twv9eyube",
    "title": "Frontend Developer Intern at MathonGo",
    "color": "teal",
    "icon": "star",
    "date": "2022-09-15",
    "cardTitle": "MathonGo - India's one of the most trusted Online Math Learning Platform ",
    "cardDescription": "Improved performance by reducing redundant API calls, enabled client side caching with React Query and media assets. Ported legacy React project to NextJS and employed various data fetching methods"
  },
  {
    "id": "m2twv9eysure",
    "title": "Fellow (Open Source Contributor) at Caravel",
    "color": "red",
    "icon": "star",
    "date": "2023-03-15",
    "cardTitle": "Plane - 🔥 Open Source JIRA, Linear and Height Alternative.",
    "cardDescription": "Implemented custom theming functionality, allowing users to personalize the appearance and added custom theming functionality, allowing users to personalize the appearance."
  }
]
